{
  "name": "PMD Design Rules",
  "version": "5.1.2",
  "children": [
    {
	    "name": "UseUtilityClass",
	    "mnemo": "UseUtilityClass",
      "priority": "3",
	    "cat": "REU",
	    "desc": [
	      "For classes that only have static methods, consider making them utility classes. Note that this doesn't apply to abstract classes, since their subclasses may well include non-static methods. Also, if you want this class to be a utility class, remember to add a private constructor to prevent instantiation. (Note, that this use was known before PMD 5.1.0 as UseSingleton).",
	      "This rule impacts reusability, since making the class a utility would ease its access and usage."
	    ]
	  },
    {
	    "name": "Simplify Boolean Returns",
	    "mnemo": "SimplifyBooleanReturns",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Avoid unnecessary if-then-else statements when returning a boolean. The result of the conditional test can be returned instead.",
	      "This rule impacts analysability, since unnecessary code confuses the reader."
	    ]
	  },
    {
	    "name": "Simplify Boolean Expressions",
	    "mnemo": "SimplifyBooleanExpressions",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Avoid unnecessary comparisons in boolean expressions, they serve no purpose and impacts readability.",
	      "This rule impacts analysability, since unnecessary code confuses the reader."
	    ]
	  },
    {
	    "name": "Switch Statements Should Have Default",
	    "mnemo": "SwitchStmtsShouldHaveDefault",
      "priority": "1",
	    "cat": "REL",
	    "desc": [
	      "All switch statements should include a default option to catch any unspecified values.",
	      "This rule impacts reliability, since an unpredictable behaviour may result if the switch value was not intended."
	    ]
	  },
    {
	    "name": "Avoid Deeply Nested If Statements",
	    "mnemo": "AvoidDeeplyNestedIfStmts",
      "priority": "2",
	    "cat": "ANA CHA TES",
	    "desc": [
	      "Avoid creating deeply nested if-then statements since they are harder to read and error-prone to maintain. The nesting threshold can be configured by the user, default value is 3.",
	      "This rule impacts analysability, since deeply nested control structure are hard to understand past a given threshold. It also impacts changeability, since a maintainer will need to check the whole structure to apply a change. It also impacts testability, since it increases the number of paths to check."
	    ]
	  },
    {
	    "name": "Avoid Reassigning Parameters",
	    "mnemo": "AvoidReassigningParameters",
      "priority": "2",
	    "cat": "CHA",
	    "desc": [
	      "Reassigning values to incoming parameters is not recommended. Use temporary local variables instead.",
	      "This rule impacts changeability, since the maintainer may assume that the parameters contain the passed values."
	    ]
	  },
    {
	    "name": "Switch Density",
	    "mnemo": "SwitchDensity",
      "priority": "3",
	    "cat": "ANA CHA",
	    "desc": [
	      "A high ratio of statements to labels in a switch statement implies that the switch statement is overloaded. Consider moving the statements into new methods or creating subclasses based on the switch variable. The threshold can be configured by the user, default value is 10.",
	      "Switch Density is the number of statements over the number of cases within a switch. The higher the value, the more work each case is doing. When the Switch Density is high, you should start looking at Subclasses or State Pattern to alleviate the problem.",
	      "This rule impacts analysability, since it builds a complex control structure. It also impacts changeability, since it implies a large number of complex paths, which may cause side-effects."
	    ]
	  },
    {
	    "name": "Constructor Calls Overridable Method",
	    "mnemo": "ConstructorCallsOverridableMethod",
      "priority": "2",
	    "cat": "REL",
	    "desc": [
	      "Calling overridable methods during construction poses a risk of invoking methods on an incompletely constructed object and can be difficult to debug. It may leave the sub-class unable to construct its superclass or forced to replicate the construction process completely within itself, losing the ability to call super(). If the default constructor contains a call to an overridable method, the subclass may be completely uninstantiable. Note that this includes method calls throughout the control flow graph - i.e., if a constructor Foo() calls a private method bar() that calls a public method buz(), this denotes a problem.",
	      "Searches through all methods and constructors called from constructors. It marks as dangerous any call to overridable methods from non-private constructors. It marks as dangerous any calls to dangerous private constructors from non-private constructors.",
	      "This rule impacts reliability, since the object may not be fully initialised. It may throw exceptions or cause an unpredictable behaviour."
	    ]
	  },
    {
	    "name": "Accessor Class Generation",
	    "mnemo": "AccessorClassGeneration",
      "priority": "3",
	    "cat": "",
	    "desc": [
	      "Instantiation by way of private constructors from outside of the constructor's class often causes the generation of an accessor. A factory method, or non-privatization of the constructor can eliminate this situation. The generated class file is actually an interface. It gives the accessing class the ability to invoke a new hidden package scope constructor that takes the interface as a supplementary parameter. This turns a private constructor effectively into one with package scope, and is challenging to discern.",
	      "Javadoc's description of the execution: 1. Note all private constructors. 2. Note all instantiations from outside of the class by way of the private constructor. 3. Flag instantiations."
	    ]
	  },
    {
	    "name": "Final Field Could Be Static",
	    "mnemo": "FinalFieldCouldBeStatic",
      "priority": "3",
	    "cat": "EFF",
	    "desc": [
	      "If a final field is assigned to a compile-time constant, it could be made static, thus saving overhead in each object at runtime.",
	      "This rule impacts resources usage, because of the overhead of the non-static field."
	    ]
	  },
    {
	    "name": "Close Resource",
	    "mnemo": "CloseResource",
      "priority": "2",
	    "cat": "EFF",
	    "desc": [
	      "Ensure that resources (like Connection, Statement, and ResultSet objects) are always closed after use.",
	      "Makes sure you close your database connections. It does this by looking for code patterned like this: Connection c = X; try { // do stuff, and maybe catch something } finally { c.close(); }",
	      "This rule impacts resources usage, since unneeded open connections take some memory and cpu."
	    ]
	  },
    {
	    "name": "Non Static Initializer",
	    "mnemo": "NonStaticInitializer",
      "priority": "2",
	    "cat": "ANA",
	    "desc": [
	      "A non-static initializer block will be called any time a constructor is invoked (just prior to invoking the constructor). While this is a valid language construct, it is rarely used and is confusing.",
	      "This rule impacts analysability, since a maintainer will look for the constructor as the first chunk of code executed."
	    ]
	  },
    {
	    "name": "Default Label Not Last In Switch Statement",
	    "mnemo": "DefaultLabelNotLastInSwitchStmt",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "By convention, the default label should be the last label in a switch statement.",
	      "This rule impacts analysability, since the maintainer will have trouble seeing the default case."
	    ]
	  },
    {
	    "name": "Non Case Label In Switch Statement",
	    "mnemo": "NonCaseLabelInSwitchStatement",
      "priority": "2",
	    "cat": "ANA",
	    "desc": [
	      "A non-case label (e.g. a named break/continue label) was present in a switch statement. This is legal, but confusing. It is easy to mix up the case labels and the non-case labels.",
	      "This rule impacts analysability, since this may confuse the maintainer when reading the switch. By the way, introducing a label <i>in</i> the switch creates an intricate control flow and is discouraged."
	    ]
	  },
    {
	    "name": "Optimizable toArray Call",
	    "mnemo": "OptimizableToArrayCall",
      "priority": "3",
	    "cat": "EFF",
	    "desc": [
	      "Calls to a collection's toArray() method should specify target arrays sized to match the size of the collection. Initial arrays that are too small are discarded in favour of new ones that have to be created that are the proper size.",
	      "This rule impacts resources, since the array will have to be discarded and recreated at the right size when it is populated."
	    ]
	  },
    {
	    "name": "Bad Comparison",
	    "mnemo": "BadComparison",
      "priority": "2",
	    "cat": "REL",
	    "desc": [
	      "Avoid equality comparisons with Double.NaN. Due to the implicit lack of representation precision when comparing floating point numbers these are likely to cause logic errors.",
	      "This rule impacts reliability, since the comparison may produce unpredictable behaviour because of the floating precision."
	    ]
	  },
    {
	    "name": "Equals Null",
	    "mnemo": "EqualsNull",
      "priority": "3",
	    "cat": "REL",
	    "desc": [
	      "Tests for null should not use the equals() method, since it will throw an exception if the variable is null instead of going in the loop. The '==' operator should be used instead.",
	      "This rule impacts reliability, since a NullPointerException may be thrown if the variable is indeed null.",
	      "TODO: not sure this rule is widely used."
	    ]
	  },
    {
	    "name": "Confusing Ternary",
	    "mnemo": "ConfusingTernary",
      "priority": "2",
	    "cat": "ANA",
	    "desc": [
	      "Avoid negation within an 'if' expression with an 'else' clause. For example, rephrase: if (x != y) diff(); else same(); as: if (x == y) same(); else diff(); Most 'if (x != y)' cases without an 'else' are often return cases, so consistent use of this rule makes the code easier to read. Also, this resolves trivial ordering problems, such as 'does the error case go first?' or 'does the common case go first?'.",
	      "This rule impacts analysability."
	    ]
	  },
    {
	    "name": "Instantiation To Get Class",
	    "mnemo": "InstantiationToGetClass",
      "priority": "3",
	    "cat": "EFF",
	    "desc": [
	      "Avoid instantiating an object just to call getClass() on it; use the .class public member instead.",
	      "This rule impacts resources, since the object will be unnecessarily created."
	    ]
	  },
    {
	    "name": "Idempotent Operations",
	    "mnemo": "IdempotentOperations",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Avoid idempotent operations - they have no effect.",
	      "This rule impacts analysis, since it adds unnecessary code."
	    ]
	  },
    {
	    "name": "Simple Date Format Needs Locale",
	    "mnemo": "SimpleDateFormatNeedsLocale",
      "priority": "3",
	    "cat": "REL",
	    "desc": [
	      "Be sure to specify a Locale when creating SimpleDateFormat instances to ensure that locale-appropriate formatting is used.",
	      "This rule impacts reliability, since it may produce an unpredictable behaviour for different locales."
	    ]
	  },
    {
	    "name": "Immutable Field",
	    "mnemo": "ImmutableField",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Identifies private fields whose values never change once they are initialized either in the declaration of the field or by a constructor. This helps in converting existing classes to becoming immutable ones.",
	      "This rule impacts analysability, since it will help the maintainer understand the variable is not supposed to change."
	    ]
	  },
    {
	    "name": "Use Locale With Case Conversions",
	    "mnemo": "UseLocaleWithCaseConversions",
      "priority": "3",
	    "cat": "EFF",
	    "desc": [
	      "When doing <code>String.toLowerCase()</code>/<code>toUpperCase()</code> conversions, use Locales to avoids problems with languages that have unusual conventions, i.e. Turkish.",
	      "This rule impacts reliability, since it may produce an unpredictable behaviour for different locales."
	    ]
	  },
    {
	    "name": "Avoid Protected Field In Final Class",
	    "mnemo": "AvoidProtectedFieldInFinalClass",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      " Do not use protected fields in final classes since they cannot be subclassed. Clarify your intent by using private or package access modifiers instead.",
	      "This rule impacts analysability, since the intent of the field modifier is not clear."
	    ]
	  },
    {
	    "name": "Assignment To Non Final Static",
	    "mnemo": "AssignmentToNonFinalStatic",
      "priority": "3",
	    "cat": "REL",
	    "desc": [
	      "Identifies a possible unsafe usage of a static field.",
	      "This rule impacts reliability, since the variable may be modified by another calls, producing an unpredictable behaviour."
	    ]
	  },
    {
	    "name": "Missing Static Method In Non Instantiatable Class",
	    "mnemo": "MissingStaticMethodInNonInstantiatableClass",
      "priority": "3",
	    "cat": "EFF ANA",
	    "desc": [
	      "A class that has private constructors and does not have any static methods or fields cannot be used.",
	      "This rule impacts analysability, since an unusable class represents unnecessary code. It also impact resources for the memory unnecessarily used."
	    ]
	  },
    {
	    "name": "Avoid Synchronized At Method Level",
	    "mnemo": "AvoidSynchronizedAtMethodLevel",
      "priority": "3",
	    "cat": "EFF CHA",
	    "desc": [
	      "Method-level synchronization can cause problems when new code is added to the method. Block-level synchronization helps to ensure that only the code that needs synchronization gets it.",
	      "This rule impacts resources, since unnecessarily synchronised code will cluter threads queue. It also impacts changeability, since the maintainer will need to refactor the method to add unsynchronised code."
	    ]
	  },
    {
	    "name": "Missing Break In Switch",
	    "mnemo": "MissingBreakInSwitch",
      "priority": "2",
	    "cat": "REL CHA",
	    "desc": [
	      "Switch statements without break or return statements for each case option may indicate problematic behaviour. Empty cases are ignored as these indicate an intentional fall-through.",
	      "This rule impacts reliability, since an unpredictable behaviour may arise when unintendedly falling through the next case. It also impacts changeability, since introducing a new case may modify the behaviour of the previous one."
	    ]
	  },
    {
	    "name": "Use Notify All Instead Of Notify",
	    "mnemo": "UseNotifyAllInsteadOfNotify",
      "priority": "3",
	    "cat": "REL",
	    "desc": [
	      "Thread.notify() awakens a thread monitoring the object. If more than one thread is monitoring, then only one is chosen. The thread chosen is arbitrary; thus its usually safer to call notifyAll() instead.",
	      "This rule impacts reliability, since the notified thread is chosen arbitrary among the waiters and an unintended behaviour may arise."
	    ]
	  },
    {
	    "name": "Avoid Instanceof() Checks In Catch Clause",
	    "mnemo": "AvoidInstanceofChecksInCatchClause",
      "priority": "3",
	    "cat": "CHA",
	    "desc": [
	      "Each caught exception type should be handled in its own catch clause.",
	      "This rule impacts changeability, since the type of exception and its treatment is straight-forward."
	    ]
	  },
    {
	    "name": "Abstract Class Without Abstract Method",
	    "mnemo": "AbstractClassWithoutAbstractMethod",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "The abstract class does not contain any abstract methods. An abstract class suggests an incomplete implementation, which is to be completed by subclasses implementing the abstract methods. If the class is intended to be used as a base class only (not to be instantiated directly) a protected constructor can be provided to prevent direct instantiation.",
	      "This rule impacts analysability, since the class is pointless regarding the abstract intent and the maintain will wonder why this class is abstract."
	    ]
	  },
    {
	    "name": "Simplify Conditional",
	    "mnemo": "SimplifyConditional",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "No need to check for null before an instanceof; the instanceof keyword returns false when given a null argument.",
	      "This rule impacts analysability, since the pattern implies unnecessary code."
	    ]
	  },
    {
	    "name": "Compare Objects With Equals",
	    "mnemo": "CompareObjectsWithEquals",
      "priority": "3",
	    "cat": "REL",
	    "desc": [
	      "Use equals() to compare object references; avoid comparing them with ==.",
	      "This rule impacts reliability, since the == operator is not consistent over all types of objects and an exception may arise.",
	      "TODO: This rule also includes Enum's, which is wrong -- comparing Enums with equal might even considered good practice. See http://sourceforge.net/p/pmd/bugs/909/"
	    ]
	  },
    {
	    "name": "Position Literals First In Comparisons",
	    "mnemo": "PositionLiteralsFirstInComparisons",
      "priority": "2",
	    "cat": "REL",
	    "desc": [
	      "Position literals first in comparisons, if the second argument is null then NullPointerExceptions can be avoided, they will just return false.",
	      "This rule impacts reliability, since a NullPointerException will arise if the object is null."
	    ]
	  },
    {
	    "name": "Position Literals First In Case Insensitive Comparisons",
	    "mnemo": "PositionLiteralsFirstInCaseInsensitiveComparisons",
      "priority": "2",
	    "cat": "REL",
	    "desc": [
	      "Position literals first in comparisons, if the second argument is null then NullPointerExceptions can be avoided, they will just return false.",
	      "This rule impacts reliability, since a NullPointerException will arise if the object is null."
	    ]
	  },
    {
	    "name": "Unnecessary Local Before Return",
	    "mnemo": "UnnecessaryLocalBeforeReturn",
      "priority": "3",
	    "cat": "ANA EFF",
	    "desc": [
	      "Avoid the creation of unnecessary local variables.",
	      "This rule impacts analysability, since it implies unnecessary code. It also impacts resources, since an unnecessary variable is created."
	    ]
	  },
    {
	    "name": "Non Thread Safe Singleton",
	    "mnemo": "NonThreadSafeSingleton",
      "priority": "2",
	    "cat": "REL",
	    "desc": [
	      "Non-thread safe singletons can result in bad state changes. Eliminate static singletons if possible by instantiating the object directly. Static singletons are usually not needed as only a single instance exists anyway. Other possible fixes are to synchronize the entire method or to use an initialize-on-demand holder class (do not use the double-check idiom). See Effective Java, item 48.",
	      "This rule impacts reliability, since bad state changes may induce an unpredictable behaviour."
	    ]
	  },
    {
	    "name": "Uncommented Empty Method",
	    "mnemo": "UncommentedEmptyMethod",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Uncommented Empty Method finds instances where a method does not contain statements, but there is no comment. By explicitly commenting empty methods it is easier to distinguish between intentional (commented) and unintentional empty methods.",
	      "This rule impacts analysability, since the maintainer does not know if the empty method was really intended and useful."
	    ]
	  },
    {
	    "name": "Uncommented Empty Constructor",
	    "mnemo": "UncommentedEmptyConstructor",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Uncommented Empty Constructor finds instances where a constructor does not contain statements, but there is no comment. By explicitly commenting empty constructors it is easier to distinguish between intentional (commented) and unintentional empty constructors.",
	      "This rule impacts analysability, since the maintainer does not know if the empty constructor was really intended and useful."
	    ]
	  },
    {
	    "name": "Avoid Constants Interface",
	    "mnemo": "AvoidConstantsInterface",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "An interface should be used only to characterize the external behaviour of an implementing class: using an interface as a container of constants is a poor usage pattern and not recommended.",
	      "This rule impacts analysability, since the maintainer may have trouble understanding why the class is declared as an interface."
	    ]
	  },
    {
	    "name": "Unsynchronized Static Date Formatter",
	    "mnemo": "UnsynchronizedStaticDateFormatter",
      "priority": "3",
	    "cat": "REL",
	    "desc": [
	      "SimpleDateFormat instances are not synchronized. Sun recommends using separate format instances for each thread. If multiple threads must access a static formatter, the formatter must be synchronized either on method or block level.",
	      "Using a DateFormatter (SimpleDateFormatter) which is static can cause unexpected results when used in a multi-threaded environment. This rule will find static (Simple)DateFormatters which are used in an unsynchronized manner. Refer to these Bug Parade issues: 4093418 4228335 4261469 see RFE1020790 - Check for SimpleDateFormat as singleton http://sourceforge.net/tracker/index.php?func=detail&aid=1020790&group_id=56262&atid=479924",
	      "This rule impacts reliability, since an unexpected behaviour may arise from the thread's synchronisation."
	    ]
	  },
    {
	    "name": "Preserve Stack Trace",
	    "mnemo": "PreserveStackTrace",
      "priority": "2",
	    "cat": "ANA",
	    "desc": [
	      "Throwing a new exception from a catch block without passing the original exception into the new exception will cause the original stack trace to be lost making it difficult to debug effectively.",
	      "This rule impacts analysability, since the original exception trace is lost."
	    ]
	  },
    {
	    "name": "Use Collection isEmpty",
	    "mnemo": "UseCollectionIsEmpty",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "The isEmpty() method on java.util.Collection is provided to determine if a collection has any elements. Comparing the value of size() to 0 does not convey intent as well as the isEmpty() method.",
	      "This rule impacts analysability, since the intent is much clearer for the maintainer."
	    ]
	  },
    {
	    "name": "Class With Only Private Constructors Should Be Final",
	    "mnemo": "ClassWithOnlyPrivateConstructorsShouldBeFinal",
      "priority": "2",
	    "cat": "ANA",
	    "desc": [
	      "A class with only private constructors should be final, unless the private constructor is invoked by a inner class.",
	      "This rule impacts analysability, since the maintainer will have trouble understanding the intent of the class."
	    ]
	  },
    {
	    "name": "Empty Method In Abstract Class Should Be Abstract",
	    "mnemo": "EmptyMethodInAbstractClassShouldBeAbstract",
      "priority": "3",
	    "cat": "REU",
	    "desc": [
	      "Empty methods in an abstract class should be tagged as abstract. This helps to remove their inapproprate usage by developers who should be implementing their own versions in the concrete subclasses.",
	      "This rule impacts reusability, since it helps inheriting the class correctly."
	    ]
	  },
    {
	    "name": "Singular Field",
	    "mnemo": "SingularField",
      "priority": "3",
	    "cat": "CHA",
	    "desc": [
	      "Fields whose scopes are limited to just single methods do not rely on the containing object to provide them to other methods. They may be better implemented as local variables within those methods.",
	      "This rule impacts changeability, since it is easier to modify a variable at the method level than at the class level."
	    ]
	  },
    {
	    "name": "Return Empty Array Rather Than Null",
	    "mnemo": "ReturnEmptyArrayRatherThanNull",
      "priority": "3",
	    "cat": "REL",
	    "desc": [
	      "For any method that returns an array, it is a better to return an empty array rather than a null reference. This removes the need for null checking all results and avoids inadvertent NullPointerExceptions. ",
	      "This rule impacts reliability, since a NullPointerException may arise from the method's caller."
	    ]
	  },
    {
	    "name": "Abstract Class Without Any Method",
	    "mnemo": "AbstractClassWithoutAnyMethod",
      "priority": "3",
	    "cat": "CHA",
	    "desc": [
	      "If an abstract class does not provides any methods, it may be acting as a simple data container that is not meant to be instantiated. In this case, it is probably better to use a private or protected constructor in order to prevent instantiation than make the class misleadingly abstract.",
	      "This rule impacts changeability, since the intent of the class is made much clearer for the maintainer."
	    ]
	  },
    {
	    "name": "Too Few Branches For A Switch Statement",
	    "mnemo": "TooFewBranchesForASwitchStatement",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Switch statements are indended to be used to support complex branching behaviour. Using a switch for only a few cases is ill-advised, since switches are not as easy to understand as if-then statements. In these cases use the if-then statement to increase code readability. Default value is 3 and above.",
	      "This rule impacts analysability, since the switch statement is more difficult to read than a simple if-then."
	    ]
	  },
    {
	    "name": "Logic Inversion",
	    "mnemo": "LogicInversion",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Use opposite operator instead of negating the whole expression with a logic complement operator.",
	      "This rule impacts analysability, since it is easier to read a condition than its negation."
	    ]
	  },
    {
	    "name": "Use Varargs",
	    "mnemo": "UseVarargs",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Java 5 introduced the varargs parameter declaration for methods and constructors. This syntactic sugar provides flexibility for users of these methods and constructors, allowing them to avoid having to deal with the creation of an array.",
	      "This rule impacts analysability, since varargs were intended to be easier to read than arrays."
	    ]
	  },
    {
	    "name": "Field Declarations Should Be At Start Of Class",
	    "mnemo": "FieldDeclarationsShouldBeAtStartOfClass",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Fields should be declared at the top of the class, before any method declarations, constructors, initializers or inner classes. ",
	      "This rule impacts analysability, since most people will assume that all declarations are done at the start of the class."
	    ]
	  },
    {
	    "name": "God Class",
	    "mnemo": "GodClass",
      "priority": "2",
	    "cat": "ANA CHA",
	    "desc": [
	      "The God Class rule detects the God Class design flaw using metrics. God classes do too many things, are very big and overly complex. They should be split apart to be more object-oriented. The rule uses the detection strategy described in 'Object-Oriented Metrics in Practice'. The violations are reported against the entire class. See also the references: Michele Lanza and Radu Marinescu. Object-Oriented Metrics in Practice: Using Software Metrics to Characterize, Evaluate, and Improve the Design of Object-Oriented Systems. Springer, Berlin, 1 edition, October 2006. Page 80.",
	      "This rule impacts analysability, since an overly complex class is difficult to read. It also impact changeability, since separating the various fonctionalities of the class may be difficult."
	    ]
	  },
    {
	    "name": "Avoid Protected Method In Final Class Not Extending",
	    "mnemo": "AvoidProtectedMethodInFinalClassNotExtending",
      "priority": "3",
	    "cat": "ANA",
	    "desc": [
	      "Do not use protected methods in most final classes since they cannot be subclassed. This should only be allowed in final classes that extend other classes with protected methods (whose visibility cannot be reduced). Clarify your intent by using private or package access modifiers instead.",
	      "This rule impacts analysability, since the intent of the method modifier is not clear."
	    ]
	  }
  ]
}
