  {
    "name": "Alambic Metrics for Stack Overflow",
    "version": "0.1",
    "children": [
      {
        "name": "Stack Overflow Questions (5Y)",
        "mnemo": "SO_QUESTIONS_VOL_5Y",
        "desc": [
            "The number of questions related to the project's tag posted on Stack Overflow during the last 5 years.",
            "Having many questions posted about the project indicates a strong interest from the community. The list of questions associated to the tag can be browsed on the <a href=\"https://stackoverflow.com/questions/tagged/java\">Stack Overflow web site</a>."
        ],
        "scale": [5,50,400,800]
      },
      {
        "name": "Stack Overflow Answers (5Y)",
        "mnemo": "SO_ANSWERS_VOL_5Y",
        "desc": [
            "The number of answers to questions related to the project's tag posted on Stack Overflow during the last 5 years.",
            "Having many answers posted about the project indicates a strong interest from the community, and a good support. The list of questions and their answers associated to the tag can be browsed on the <a href=\"https://stackoverflow.com/questions/tagged/java\">Stack Overflow web site</a>."
        ],
        "scale": [1,2,3,4]
      },
      {
        "name": "Stack Overflow Answer rate (5Y)",
        "mnemo": "SO_ANSWER_RATE_5Y",
        "desc": [
            "The average number of answers per questions related to the project's tag on Stack Overflow during the last 5 years.",
            "Having many answers posted about the project indicates a strong interest from the community, and a good support. The list of questions and their answers associated to the tag can be browsed on the <a href=\"https://stackoverflow.com/questions/tagged/java\">Stack Overflow web site</a>."
        ],
        "scale": [1,2,4,5]
      },
      {
        "name": "Stack Overflow Askers (5Y)",
        "mnemo": "SO_ASKERS_5Y",
        "desc": [
            "The number of distinct people asking questions related to the project's tag posted on Stack Overflow during the last 5 years.",
            "Having many people ask questions about the project indicates a strong interest from the community, and a good support. The list of questions and their answers associated to the tag can be browsed on the <a href=\"https://stackoverflow.com/questions/tagged/java\">Stack Overflow web site</a>."
        ],
        "scale": [1,3,5,10]
      },
      {
        "name": "Stack Overflow Votes (5Y)",
        "mnemo": "SO_VOTES_VOL_5Y",
        "desc": [
            "The total number of votes on questions related to the project's tag on Stack Overflow during the last 5 years.",
            "Having many votes on questions about the project indicates a strong interest from the community. The list of questions and their answers associated to the tag can be browsed on the <a href=\"https://stackoverflow.com/questions/tagged/java\">Stack Overflow web site</a>."
        ],
        "scale": [10,100,250,500]
      },
      {
        "name": "Stack Overflow Views (5Y)",
        "mnemo": "SO_VIEWS_VOL_5Y",
        "desc": [
            "The total number of views for questions related to the project's tag on Stack Overflow during the last 5 years.",
            "Having many views on questions about the project indicates a strong interest from the community. The list of questions and their answers associated to the tag can be browsed on the <a href=\"https://stackoverflow.com/questions/tagged/java\">Stack Overflow web site</a>."
        ],
        "scale": [100,1000,2500,5000]
      }
    ]
  }
